Applying **Development**:

```diff
data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=Ew]
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_iam_role.this: Refreshing state... [id=terraform-20220914153256837100000001]
aws_vpc.this[0]: Refreshing state... [id=vpc-0eeedf0c933b0bac1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_subnet.public[0]: Refreshing state... [id=subnet-066368a5b1565f38d]
aws_route_table.private[0]: Refreshing state... [id=rtb-03a835b7ccca86cd3]
aws_security_group.trusted[0]: Refreshing state... [id=sg-06b9f344b451fa4b8]
aws_route_table.public[0]: Refreshing state... [id=rtb-059ac2bfde8bc480b]
aws_security_group.public[0]: Refreshing state... [id=sg-0d7ba95643df242ef]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e24dce1f54fb816f]
aws_security_group.lan[0]: Refreshing state... [id=sg-0fc30484bcfc30f12]
aws_subnet.private[0]: Refreshing state... [id=subnet-095f86a4765c165e3]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-092bac5496c28ead3]
aws_network_interface.public: Refreshing state... [id=eni-0e7641498acc0ba7f]
aws_route.public: Refreshing state... [id=r-rtb-059ac2bfde8bc480b1080289494]
aws_network_interface.private: Refreshing state... [id=eni-01e47db0b967c25a7]
aws_route.private: Refreshing state... [id=r-rtb-03a835b7ccca86cd31080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.this is tainted, so must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::447552758530:role/terraform-20220914153256837100000001" -> (known after apply)
      ~ create_date           = "2022-09-14T15:32:57Z" -> (known after apply)
      ~ id                    = "terraform-20220914153256837100000001" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "terraform-20220914153256837100000001" -> (known after apply)
      ~ name_prefix           = "terraform-" -> (known after apply)
        tags                  = {
            "Name" = "ec2-iam-role-sophos-xg13-447552758530"
        }
      ~ unique_id             = "AROAWQNBZEMBN2FRGWFAC" -> (known after apply)
        # (5 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-06b9f344b451fa4b8"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "20.169.169.99/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "20.185.52.43/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

```
random_id.this: Refreshing state... [id=Ew]
data.http.my_public_ip: Reading...
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.trust_relationship: Reading...
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
aws_vpc.this[0]: Refreshing state... [id=vpc-0eeedf0c933b0bac1]
aws_iam_role.this: Refreshing state... [id=terraform-20220914153256837100000001]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-2]
random_shuffle.az: Refreshing state... [id=-]
aws_security_group.lan[0]: Refreshing state... [id=sg-0fc30484bcfc30f12]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e24dce1f54fb816f]
aws_subnet.private[0]: Refreshing state... [id=subnet-095f86a4765c165e3]
aws_security_group.trusted[0]: Refreshing state... [id=sg-06b9f344b451fa4b8]
aws_route_table.private[0]: Refreshing state... [id=rtb-03a835b7ccca86cd3]
aws_subnet.public[0]: Refreshing state... [id=subnet-066368a5b1565f38d]
aws_security_group.public[0]: Refreshing state... [id=sg-0d7ba95643df242ef]
aws_route_table.public[0]: Refreshing state... [id=rtb-059ac2bfde8bc480b]
aws_network_interface.private: Refreshing state... [id=eni-01e47db0b967c25a7]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-092bac5496c28ead3]
aws_route.public: Refreshing state... [id=r-rtb-059ac2bfde8bc480b1080289494]
aws_network_interface.public: Refreshing state... [id=eni-0e7641498acc0ba7f]
aws_route.private: Refreshing state... [id=r-rtb-03a835b7ccca86cd31080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.this is tainted, so must be replaced
-/+ resource "aws_iam_role" "this" {
      ~ arn                   = "arn:aws:iam::447552758530:role/terraform-20220914153256837100000001" -> (known after apply)
      ~ create_date           = "2022-09-14T15:32:57Z" -> (known after apply)
      ~ id                    = "terraform-20220914153256837100000001" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "terraform-20220914153256837100000001" -> (known after apply)
      ~ name_prefix           = "terraform-" -> (known after apply)
        tags                  = {
            "Name" = "ec2-iam-role-sophos-xg13-447552758530"
        }
      ~ unique_id             = "AROAWQNBZEMBN2FRGWFAC" -> (known after apply)
        # (5 unchanged attributes hidden)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-06b9f344b451fa4b8"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "20.169.169.99/32",
                ]
              + description      = "Allow all from trusted IP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          - {
              - cidr_blocks      = [
                  - "20.185.52.43/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
        tags                   = {
            "Name" = "Trusted Network"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
aws_iam_role.this: Destroying... [id=terraform-20220914153256837100000001]
aws_security_group.trusted[0]: Modifying... [id=sg-06b9f344b451fa4b8]
aws_iam_role.this: Destruction complete after 0s
aws_iam_role.this: Creating...
aws_iam_role.this: Creation complete after 1s [id=terraform-20220914153823002100000001]
aws_security_group.trusted[0]: Modifications complete after 1s [id=sg-06b9f344b451fa4b8]

Apply complete! Resources: 1 added, 1 changed, 1 destroyed.

```